---
layout: post
title: 小谈摄影
category: essay
---

这个标题我纠结了好久，因为『谈论』一般是牛人们的用词，本人摄影小菜鸟一枚，不敢随便用，但一时又找不到合适的词，就先借用一下了。

注：以下内容，纯属个人观点，如有同感，深感荣幸 :)

摄影的时间不长，拍照倒是有些年头了，很多人会把拍照和摄影混为一谈，就好像会写代码的都是程序员，会入侵电脑的都是黑客一样。在我看来，摄影最重要的是一颗敏感的心和善于发现的眼睛(器材当然也重要，但重要性不如前者），而拍照只需要一个还过得去的相机就行。拍照的一个很重要作用是留念，如和李开复合影，或者在故宫门前摆个POSE，或者看到某个美景，忍不住按下了快门。而摄影不一样，摄影要累多了，同样是面对某个美景，一个优秀的摄手会尝试各种拍摄手法、构图、用光、光圈大小、快门时间等等，比如面对瀑布，增加快门时间，可以营造水幕的感觉，缩短快门时间又可以抓住飞溅而起的水花。但如果只是拍照，那么拿相机对着瀑布，咔嚓一下就可以了，算是对自己去过某地的证明。

一个优秀的摄影作品至少要满足『美』和『故事』两者中的一个。美不用说了，故事的意思是，看到一张照片，你会被照片中的主体所吸引，进而去猜测作者拍此照片的意图，甚至去想像作者当时的心情，姿态，等等。照片本身不一定惊艳，但背后的故事却值得细细回味。比如<a href="http://www.flickr.com/photos/zhou_mengjie/6318039145">这张</a>

<img src="http://farm7.staticflickr.com/6094/6318039145_0eef0af250_z.jpg" />

第一眼可能觉得并不是很漂亮，但马上会被主体所吸引：dancing in the rain。可以从这张照片中看到一种生活态度：大多数人在雨天的路上，多半是行色匆匆，而照片中的主角却可以享受这场雨，雨仿佛成为了一个道具。如果喜欢的话还可以进一步把雨抽象为各种挫折，然后你会看到一种与困境共舞的心态。此时，作者真正想要表达的是什么已经不重要了，重要的是你从这张照片中看到了什么。

摄影的难度还在于抓住瞬间。当你去参加婚礼，整个场面让你感到很喜庆，但当你认认真真地想找到几个喜庆的镜头时，就会卡住。大家看上去都很happy，那么是来张全景的，还是抓拍某个特别happy的人；婚礼布置的很漂亮，但是从哪个角度去拍效果最好；怎么才能表现出新郎新娘很恩爱，等等。首先脑海中要先有这些意识，然后再从现场找到能够凸显这些特点的画面，这些画面很可能稍纵即逝，或者你没有注意到，或者拍摄角度不对，等等。所以你需要不断调整，不断发现，不断按下快门。这么做的结果就是你无法融入到整个婚礼的过程，只是纯粹以一个摄影师的身份在记录。引用豆友<a href="http://www.douban.com/people/shinewewe/">想念的树</a>的一段话：

<blockquote>
我越来越意识到，好多时候我并不愿意拿出相机来截断那些美妙的时刻。我不是说拍下来那就不美妙了，只是你必须意识到并且接受那种变化，一旦发生，即产生了一个时间节点。气氛，记忆发生或多或少的改变。于是我更愿意就那样放弃拍摄的想法，让那些瞬间在记忆中延续下去，流动成诗篇。
</blockquote>

再来说说器材。经常会看到对是否应该配备高端器材的争论，主要争论点是：硬件上去了，那么出来的照片主要是你的功劳还是相机的功劳？你是否沦为了高端器材的奴隶？DigitalRev曾经做过一个实验，让一个专业的摄影师使用低端的卡片机，然后让一个基本不会摄影的人使用高端相机，结果卡片机的效果并不差，而高端相机的效果也没有好到哪去。所以一张好照片肯定是人与相机完美合作的结果。最悲惨的一个场景是，一个高端相机被一个不懂摄影的人当作炫耀的资本，那个相机一定很郁闷，空有一身好武艺，奈何主人无色心。但我还是不太喜欢一味地追求高配（因为我很穷 XDD），这会让你偏离摄影的主旨(除非是工作原因)，少了那颗发现的心，照片即使看上去很漂亮，也经不起细细品味。

摄影很难，也很累，但很有乐趣，也很有意义。送上我很喜欢的一首小诗（<a href="http://www.douban.com/group/topic/3764247/">青铮：迦陵频伽——我们所追寻的</a>）

<blockquote>
我伸手想要握住光， 
光却消失掉； 
我用镜头对准风， 
风不知去了哪里。 
然而我从不曾气馁， 
也从来不曾放弃希望； 
我总是背着我的相机， 
走过每一天，走遍这个城市。 

我曾经寻找一个女孩子的身影， 
不肯相信我不能找到， 
因为我寻找的不是她的身份或名字， 
也不是发生在她生命中的我所不知道的故事。 
我寻找的是她留在我画面上的东西， 
还有我的画面不曾清晰表达的东西； 
光一样会消失，却又永远在那里的东西， 
风一样不可捉摸，但总是会回来的东西。 

你别问我那是什么， 
我将不知如何回答。 
正如我不知为何我要背着相机， 
走遍这个城市，走遍这个世界， 
年复一年，直到我生命的最后一天， 
直到我还能为一个画面感动不已。 

是的，我不知道为什么， 
一如这个世界上的每一种追寻， 
我只能说，它使我的人生完整， 
它使我的生命具有意义。 
</blockquote>

最后小小的宣传下自己的小站：<a href="http://wuditoo.com">无敌兔</a>，如果你有不错的照片，不妨去分享下:)
