---
layout: post
title: 关于选择
category: essay
---

选择少的时候，痛苦，因为这说明你还不够强大。选择多的时候也痛苦，因为你要仔细考量每一个选择带来的成本。所以我们苦恼，我们总是想找到一个最好的选择，为了这个最好的选择，我们可以在候选者之间徘徊很长时间，但每每一想到这些选择，都会重复着上一次的过程，只是依然没有结果。

想起了一个故事，大意是一只驴很渴，这时它遇到了两桶水，但最后它还是渴死了，因为它不知道到底该先喝哪桶水。

选择确实重要，但没那么重要，你的人生不可能因为一次选择而彻底改变。做选择时最重要的是知道自己想要的是什么，再做决定就容易了，如果还是很纠结，那就随便选一个。也可以扔一枚硬币，两个面分别对应两个选择，但不是看它最后显示的是哪个面，而是在抛起的过程中，你最希望它是哪个面。follow your heart

<img src="/image/choice-coin.jpg" />

小时候，我们不怕做选择，因为没什么太大的后果，顶多就是被老师训一顿，被父母打打屁股，说两句。但随着年龄的增长，肩上的担子越来越重，压力也越来越大。你可能跟自己斗争了很久，做了个决定，但女友不同意，家里人反对，朋友劝说。有了孩子/房子/车子之后更麻烦。牵绊的事越多，越不利于做决定，于是我们妥协了，对生活说：生活你赢了，再见理想。

可是我们的人生只有一次啊。
