---
layout: post
title: 我理想中的公司
category: essay
---

我特别喜欢那种少而精的团队，大家齐心协力为了共同的目标而努力。人一多，心就容易散，这也增加了管理成本和沟通成本，而这两个因素往往是造成低效的重要原因。而且员工的质量很难得到控制，你不知道他们是来混日子的，还是冲着舒适来的，或是其他的目的，这就很难做到公平，除非每个入职员工都严格把关。不过这里也有个悖论，如果员工们个个都是精英，在公司规模不是很大的情况下，不会需要更多的外援；如果老是发现任务完成不了，或者效率低下，想通过扩招来弥补这些问题，那说明现在的员工很可能不够优秀。

人一多，互相熟悉也会是问题。我的理念是，我要么跟你很熟，或愿意跟你很熟，要么一点不熟。如果路上看到一个同事，知道他叫什么名字，做什么的，然后点个头示意一下，这是多么冷淡的一种表现啊，我不喜欢这样。

优秀的人才设计出来的产品，写出来的代码，是10个平庸的人加一起也无法超越的。但如团队中老是有那么一个或几个很嗝应的B类员工在掺和，而且上级对此些人还比较信任，这时事情就会向不好的方向开始发展了。因为A类人是很难或者无法与B类人共处的: 理念不一样，学习能力不一样，目标不一样。所以如果对新员工的质量降低了要求，必然会对A类员工带来不小的影响，所以要少招人，招对人。

公司是员工的家，员工是公司的家人。虽然很多公司挂出了类似的口号，但也只是口号，这甚至比没有这个口号更糟：这个公司只会说说而已。公司首先要对员工表现出家的感觉：环境舒适，水果自便，iMac，福利，不用刷卡，等等。最重要一点，把员工当人看，这是很基本的一点，但很多公司就是做不到，他们把员工当成资源，不去或者很少考虑他们的需求，他们的反馈，他们的任务量。

想想是谁决定了公司的未来，是员工啊。他们是人，他们需要被尊重，被认可，被关爱，而这些又能促使员工进一步去提升自己，去为公司创造更多的价值。这才是良性循环。领导们问都不问员工的意见，一拍板就把事情给定了，然后让他们什么时间之前完成，这不是扯淡嘛。

作为一个技术人员，当然希望到一个技术主导的公司。这样的公司国内有，且数量也还不算太少。但有自己理念的，有家的感觉的，技术主导的公司，就太少了。豆瓣算一个，除此之外还真想不出第二个。如果真找不到合适的，就只能自己创建一个了。

我比较喜欢yy, 这个场景在我的脑海里出现了好多次了：在大城市的周边，租一个大别墅，员工们如果租的房子离得比较远，或者交通不太方便，可以在那住着。选择大城市是因为大城市的人才相对较多，选择郊区是因为清静，空气好，风景好，房租便宜。别墅的前面是一片草坪，搞点什么活动都可以。

<img src="/image/the-whole-team.jpg" />

公司内部的氛围一定要轻松，环境要舒适，工作区就算达不到每个人单独一间房间，至少空间要足够大，尽量少的干扰。可以配一块白板，但最好在一个独立的房间，以免打扰到其他人。

<img src="/image/team.jpg" width="640"/>

要有休闲区，如电影放映厅、游戏室、乒乓球、K歌厅等等，总之，就是要让员工感觉到公司为了员工的生活做了很多努力。那如果员工花很多的时间在休闲上怎么办？没有问题，只要你高质量地完成了自己的任务。

<img src="/image/game-room.jpg" />

员工把生命中的一部分时间给了公司，公司当然要给予相应的回报。对于那些对公司做出很多贡献的更应该奖励，这些人不光是公司觉得他们付出了很多，员工也会觉得他们获此待遇是应该的，并会以他们为榜样。这样就建立起了良性循环。

有点幼稚，有点过于理想，随着时间的流逝，阅历的增长，肯定会有部分变化，真希望在不远的将来多看到那样的公司，那里是理想主义者的天堂。
